using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class Level : MonoBehaviour
{
    //Для того чтобы создать и описать уровни игры, необходимо: 
    //1. Стартовый диалог с пользователем - выбор климатической зоны, сезоны.
    //2. Задать в настройках каждого уровня целевые параметры по скорости роста травы, здоровью тровоядного и хищника, скорости
    //их размножения, необходимого количества пищи для начала размножения и уровень бессмертия.
    //3. Для каждого уровня выбрать цель по количественным показателям: количество травы, тровоядных и хищников, которые
    //одновременно присутствуют на игровом поле. Например: травы 20 кустов, кроликов 10 штук и лис 3 штуки. Достижения всех этих
    //показателей одновременно приводит к переходу на следующий уровень игры.

    // Start is called before the first frame update
    void Start()
    {
        
    }

    // Update is called once per frame
    void Update()
    {
        
    }
}
